app/views/users/list.html.erb

<br/>
<% User.all.each do |user| %>
---
SELECT `users`.* FROM `users`