app/controllers/messages_controller.rb

SELECT  `messages`.* FROM `messages` WHERE `messages`.`user_id` = 15 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 15 LIMIT 1
---
  def list

    @messages = Message.where(:user_id => params[:user_id])
    @user = User.find(params[:user_id])